tutorial/solidBaffle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        nFaces          500;
        startFace       6475;
    }
    minX
    {
        type            patch;
        nFaces          25;
        startFace       6975;
    }
    maxX
    {
        type            patch;
        nFaces          25;
        startFace       7000;
    }
    minY
    {
        type            wall;
        nFaces          500;
        startFace       7025;
    }
    minZ
    {
        type            wall;
        nFaces          500;
        startFace       7525;
    }
    maxZ
    {
        type            wall;
        nFaces          500;
        startFace       8025;
    }
)

// ************************************************************************* //
