tutorial/solidBaffle/system/rightSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        maxX
        {
            type            patch;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 300;
            }
            "rightSolid_to_.*"
            {
                type            compressible::myturbulentTemperatureCoupledBaffleMixed;
                neighbourFieldName T;
                kappa           solidThermo;
                kappaName       none;
                thickness       uniform 60e-6;
                baffleKappa     uniform .1;
                value           uniform 300;
            }
            maxX
            { 
                type            externalWallHeatFluxTemperature;
                kappa           solidThermo; // fluidThermo, solidThermo or lookup
//                Ta              uniform 300.0; // ambient temperature /[K]
//                h               uniform 30.0; // heat transfer coeff /[W/K/m2]
                q               uniform 20000; // heat transfer coeff /[W/K/m2]
                value uniform   300.0; // initial temperature / [K]
                kappaName       none;
            }
        }
    }
}

// ************************************************************************* //
